khakitea/Wireless-Sensor-Monitoring-System-Thread-RCP-CLI/STM32_WPAN/App/app_thread.c
}
/* USER CODE END FD_WRAP_FUNCTIONS */


static void APP_THREAD_joinerTimingElapsed( void )
{
	UTIL_SEQ_SetTask(TASK_JOIN_BUTTON,CFG_SCH_PRIO_0);
}

#if (CFG_USB_INTERFACE_ENABLE != 0)
/**
 * @brief  This function is called when thereare some data coming
 *         from the Hyperterminal via the USB port
 *         Data received over USB OUT endpoint are sent over CDC interface
 *         through this function.
 * @param  Buf: Buffer of data received
 * @param  Len: Number of data received (in bytes)
 * @retval Number of characters remaining in the buffer and not yet processed
 */
void VCP_DataReceived(uint8_t* Buf , uint32_t *Len)
{
  uint32_t i,flag_continue_checking = TRUE;
  uint32_t char_remaining = 0;
  static uint32_t len_total = 0;

  /* Copy the characters in the temporary buffer */
  for (i = 0; i < *Len; i++)
  {
    TmpString[len_total++] = Buf[i];
  }

  /* Process the buffer commands one by one     */
  /* A command is limited by a \r caracaters    */
  while (flag_continue_checking == TRUE)
  {
    char_remaining = ProcessCmdString(TmpString,len_total);
    /* If char_remaining is equal to len_total, it means that the command string is not yet
     * completed.
     * If char_remaining is equal to 0, it means that the command string has
     * been entirely processed.
     */
    if ((char_remaining == 0) || (char_remaining == len_total))
    {
      flag_continue_checking = FALSE;
    }
    len_total = char_remaining;
  }
}
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
/**
 * @brief Handles joiner commissioning
 * @param  None
 * @retval None
 */
void APP_THREAD_CommissioningJoin(void) {
	switch (temp) {
		case 0 : //first button press
			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "dataset channel 15\n\r", 20);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 20;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			//currtick = HAL_GetTick();
			prevtick = HAL_GetTick();
			while ((HAL_GetTick() - prevtick) < 1000) {
			}

			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "dataset panid 0x1234\n\r", 22);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 22;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			prevtick = HAL_GetTick();
			while ((HAL_GetTick() - prevtick) < 1000) {
			}

			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "dataset networkkey 00112233445566778899aabbccddeeff\n\r", 53);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 53;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			prevtick = HAL_GetTick();
			while ((HAL_GetTick() - prevtick) < 1000) {
			}

			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "dataset commit active\n\r", 23);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 23;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			prevtick = HAL_GetTick();
			while ((HAL_GetTick() - prevtick) < 1000) {
			}

			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "ifconfig up\n\r", 13);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 13;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			prevtick = HAL_GetTick();
			while ((HAL_GetTick() - prevtick) < 1000) {
			}

			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "thread start\n\r", 14);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 14;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			temp = 1;
			break;

		case 1 : //button has been pressed
			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "udp open\n\r", 10);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 10;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			prevtick = HAL_GetTick();
			while ((HAL_GetTick() - prevtick) < 1000)
			{	}

			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "udp connect fe80:0:0:0:f465:608b:4d93:3bf3 1234\n\r", 49);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 49;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			prevtick = HAL_GetTick();
			while ((HAL_GetTick() - prevtick) < 1000)
			{	}

			memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
			memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "udp send temp\n\r", 15);
			ThreadCliCmdBuffer.cmdserial.cmd.plen = 15;
			ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
			/* Clear receive buffer, character counter and command complete */
			CptReceiveCmdFromUser = 0;
			indexReceiveChar = 0;
			TL_CLI_SendCmd();

			prevtick = HAL_GetTick();
			while ((HAL_GetTick() - prevtick) < 1000)
			{	};

//			for (int i = 0; i < 10; i++) {
//					char* array[6];
//					memcpy(array, &temperature, 6);
//
//					memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
//					memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, &array, 6);
//					ThreadCliCmdBuffer.cmdserial.cmd.plen = 6;
//					ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
//					/* Clear receive buffer, character counter and command complete */
//					CptReceiveCmdFromUser = 0;
//					indexReceiveChar = 0;
//					TL_CLI_SendCmd();
//
//					memset(ThreadCliCmdBuffer.cmdserial.cmd.payload, 0x0U, 255U);
//					memcpy(ThreadCliCmdBuffer.cmdserial.cmd.payload, "\n\r", 2);
//					ThreadCliCmdBuffer.cmdserial.cmd.plen = 2;
//					ThreadCliCmdBuffer.cmdserial.cmd.cmdcode = 0x0;
//					/* Clear receive buffer, character counter and command complete */
//					CptReceiveCmdFromUser = 0;
//					indexReceiveChar = 0;
//					TL_CLI_SendCmd();
//
//					prevtick = HAL_GetTick();
//					while ((HAL_GetTick() - prevtick) < 1000)
//					{	}
//				}

			break;

		default :
			break;
	}

}

/* USER CODE END FD_WRAP_FUNCTIONS */


